InformationRegisters/КлиентыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлиентыСтационара</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаУсловийПребывания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ШаблоныМедицинскихДокументовСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныМедицинскихДокументовСтационара</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ШаблонОсмотра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныHTML</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольШаблона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольШаблоновСтационара</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ИзменениеРежима.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИзменениеРежима</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеРегистрацииПоказателей</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияСтационара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСтационара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияМедсестрыСтационара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СколькоРазВДень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДействия</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/АРМВрачаСтационара/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Изменено Макеев 02-12-2025 (
	
	СоответствиеШаблоновМД = Новый ФиксированноеСоответствие(СоздатьКнопкиИПолучитьЗначенияСоответствия());
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ДопПараметрыЗапроса = Новый Структура("омг_Филиалы, омг_Отделения", омг_Филиалы, омг_Отделения);
	ПациентыВСтационаре.Загрузить(ПолучитьТекущихПациентовСтационара(Ложь, ДопПараметрыЗапроса));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановкаУсловийПребывания" Тогда 
		ОбновитьСписокТекущихПациентовСтационара(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокТекущихПациентовСтационара(Команда)
	
	// Изменено Макеев 02-12-2025 (
	ПациентыВСтационаре.Очистить();	
	ДопПараметрыЗапроса = Новый Структура("омг_Филиалы, омг_Отделения", омг_Филиалы, омг_Отделения);
	ТекущиеПациенты = ПолучитьТекущихПациентовСтационара(Истина, ДопПараметрыЗапроса);
	Для Каждого СтрокаТекущегоПациента Из ТекущиеПациенты Цикл	
		ЗаполнитьЗначенияСвойств(ПациентыВСтационаре.Добавить(), СтрокаТекущегоПациента);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПребыванияПациента(Команда)
	
	ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Клиент", ТекущиеДанные.Клиент));
		ОткрытьФорму("РегистрСведений.КлиентыСтационара.ФормаСписка", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТемпературныйЛист(Команда)
	ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьФорму("Отчет.ТемпературныйЛист.Форма.ФормаОтчета",Новый Структура("Пациент, Медицинскаякарта", 
															Элементы.ПациентыВСтационаре.ТекущиеДанные.Клиент),
															Элементы.ПациентыВСтационаре.ТекущиеДанные.МедицинскаяКарта);
	КонецЕсли;
							
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЛистНазначений(Команда)
	
	ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормыОтчета = Новый Структура;
		ПараметрыФормыОтчета.Вставить("Клиент", ТекущиеДанные.Клиент);
		ПараметрыФормыОтчета.Вставить("СформироватьПриОткрытии", Истина);
		
		Если ЗначениеЗаполнено(ТекущиеДанные.МедицинскаяКарта) Тогда
			ПараметрыФормыОтчета.Вставить("МедицинскаяКарта", ТекущиеДанные.МедицинскаяКарта);
		КонецЕсли;
		
		ОткрытьФорму("Отчет.ЛистНазначений.ФормаОбъекта", Новый Структура("Клиент, СформироватьПриОткрытии", ТекущиеДанные.Клиент, Истина));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМД(Команда)
	
	ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Шаблоны = Новый Массив();
		Шаблоны.Добавить(СоответствиеШаблоновМД[Команда.Имя]);
		ПараметрыФормы = Новый Структура("ШаблоныПриема, Клиент, МедицинскаяКарта, ЭтоПриемВСтационаре", Шаблоны, ТекущиеДанные.Клиент, ТекущиеДанные.МедицинскаяКарта, Истина);
		ОткрытьФорму("Документ.Прием.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПросмотрЭМК(Команда)
	
	ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Клиент, Медицинскаякарта", ТекущиеДанные.Клиент, ТекущиеДанные.МедицинскаяКарта);
		ОткрытьФорму("Обработка.ПросмотрМедКарт.Форма.ФормаАмбулаторнаяМК", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеРежима(Команда)
	
	ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ЗначенияЗаполнения = Новый Структура("ДокументОснование, Клиент, МедицинскаяКарта",
	                                          ТекущиеДанные.ПервичныйПрием, 
											  ТекущиеДанные.Клиент, 
	                                          ТекущиеДанные.МедицинскаяКарта);	
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ДокументОснование", ));
		ФормаНазначения = ОткрытьФорму("Документ.ИзменениеРежима.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюРежимов(Команда)
	
	ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.МедицинскаяКарта) Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("МедицинскаяКарта", ТекущиеДанные.МедицинскаяКарта));
		ФормаНазначения = ОткрытьФорму("Документ.ИзменениеРежима.ФормаСписка", ПараметрыФормы, ЭтаФорма); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналТрансфузий(Команда)
	ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьФорму("Отчет.ЖурналТрансфузий.Форма.ФормаОтчета",Новый Структура("Пациент, Медицинскаякарта", 
															Элементы.ПациентыВСтационаре.ТекущиеДанные.Клиент),
															Элементы.ПациентыВСтационаре.ТекущиеДанные.МедицинскаяКарта);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПациентыВСтационареВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = ПациентыВСтационаре.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Поле = Элементы.ПациентыВСтационареДатаПоследнегоИзменения Тогда
		ПоказатьЗначение(,ТекущиеДанные.ДокументИзмененияРазмещения);
	ИначеЕсли Поле = Элементы.ПациентыВСтационареПервичныйПрием Тогда
		ПоказатьЗначение(,ТекущиеДанные.ПервичныйПрием);
	Иначе
		ПоказатьЗначение(,ТекущиеДанные.ДокументПоступления);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущихПациентовСтационара(ДляОбработкиНаКлиенте, ДопПараметры)
	
	// Изменено Макеев 02-12-2025 (
	СЗПолеМедкарта = Новый СписокЗначений;
	СЗПолеМедкарта.Добавить("МедицинскаяКарта", "ДокументПоступления.ДокументОбращения.МедицинскаяКарта");
	СЗПолеМедкарта.Добавить("ПервичныйПрием", "ДокументПоступления.ДокументОбращения.ДокументОснование");

	ДополнительныеУсловия = Новый Массив;
	
	Если Не ДопПараметры.омг_Отделения.Количество() = 0 Тогда
		ТекстЗапроса = "КлиентыСтационара.КойкоМесто.Владелец.Подразделение В (&Подразделения)";
		ПараметрЗапроса = Новый Структура("Подразделения", ДопПараметры.омг_Отделения);
		ДополнительныеУсловия.Добавить(Новый Структура("Текст, Параметры", ТекстЗапроса, ПараметрЗапроса));
	КонецЕсли;
	
	Если Не ДопПараметры.омг_Филиалы.Количество() = 0 Тогда
		ТекстЗапроса = "Регистратор.Филиал В (&Филиалы)";
		ПараметрЗапроса = Новый Структура("Филиалы", ДопПараметры.омг_Филиалы);
		ДополнительныеУсловия.Добавить(Новый Структура("Текст, Параметры", ТекстЗапроса, ПараметрЗапроса));
	КонецЕсли;
	
	ТаблицаПациентов = Стационар.ПолучитьКлиентовСтационара(ТекущаяДата(), , СЗПолеМедкарта, ДополнительныеУсловия);
	
	Для Каждого СтрокаТекущегоПациента Из ТаблицаПациентов Цикл
		
		Если СтрокаТекущегоПациента.МедицинскаяКарта = Null или СтрокаТекущегоПациента.ПервичныйПрием.Пустая()  Тогда     
			Данные = Стационар.ПолучитьМедкартуИлиСсылкуПервичногоПриемаСтационара(
						СтрокаТекущегоПациента.Клиент, ТекущаяДата(), Неопределено); // Получим и медкарту, и прием.
														
			ЗаполнитьЗначенияСвойств(СтрокаТекущегоПациента, Данные); 
		КонецЕсли;
	КонецЦикла;
	
	Если ДляОбработкиНаКлиенте Тогда
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаПациентов);
	Иначе
		Возврат ТаблицаПациентов;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СоздатьКнопкиИПолучитьЗначенияСоответствия()
	
	ПанельПодменю = Элементы.СоздатьДокументПодменю;
	СоответствиеШаблонов = Новый Соответствие;
	
	Сотрудник = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		СпециализацииСотрудника = Сотрудник.Специализации.ВыгрузитьКолонку("Специализация");
	Иначе
		СпециализацииСотрудника = Новый Массив;
	КонецЕсли;
	СпециализацииСотрудника.Добавить(Справочники.КатегорииВыработки.ПустаяСсылка());
	
	// Создадим список медицинских документов из регистра
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СпециализацииСотрудника", СпециализацииСотрудника);	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСтационара.ШаблонОсмотра КАК ШаблонОсмотра,
		|	ШаблоныСтационара.РольШаблона КАК РольШаблона,
		|	ШаблоныСтационара.Специализация КАК Специализация,
		|	ПРЕДСТАВЛЕНИЕ(ШаблоныСтационара.РольШаблона) КАК РольШаблонаПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ШаблоныСтационара.Специализация) КАК СпециализацияПредставление,
		|	ШаблоныСтационара.РольШаблона.Порядок КАК Порядок
		|ИЗ
		|	РегистрСведений.ШаблоныМедицинскихДокументовСтационара КАК ШаблоныСтационара
		|ГДЕ
		|	ШаблоныСтационара.Специализация В(&СпециализацииСотрудника)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Сч = 0;
		ИмяКоманды	 = "Кнопка"
					 + ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.РольШаблона)
					 + ?(ЗначениеЗаполнено(Выборка.Специализация), СтрЗаменить(Выборка.Специализация.УникальныйИдентификатор(),"-",""), "");
		Попытка	
	    	КомандаПриНажатии = ЭтаФорма.Команды.Добавить(ИмяКоманды);
			КомандаПриНажатии.Действие = "СоздатьМД";
			
			КнопкаШаблон = ЭтаФорма.Элементы.Добавить("Кнопка" + ИмяКоманды, Тип("КнопкаФормы"), ПанельПодменю);
			КнопкаШаблон.ИмяКоманды	 = ИмяКоманды;
			КнопкаШаблон.Заголовок	 = Выборка.РольШаблонаПредставление
									 + ?(ЗначениеЗаполнено(Выборка.Специализация), "(" + Выборка.СпециализацияПредставление + ")", "");
		Исключение		
		КонецПопытки;
		СоответствиеШаблонов.Вставить(ИмяКоманды, Выборка.ШаблонОсмотра);
	КонецЦикла;
	
	Возврат СоответствиеШаблонов;
	
КонецФункции	

&НаКлиенте
Процедура омг_ФилиалыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;//("Организация", Объект.омг_Организация);
	СписокВыбранных = омг_Филиалы;
	ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
		Новый Структура("Справочник, СписокВыбранных, Отбор", "Филиалы", СписокВыбранных, Отбор), Элементы.омг_Филиалы,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ОтделенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбранных = омг_Отделения;

	Отбор = Новый Структура;//("Организация", Объект.омг_Организация);
	
	ПараметрыЗапроса = Новый Массив;
	ПараметрыЗапроса.Добавить(Новый Структура("Параметр, Значение", "Филиалы", омг_Филиалы.ВыгрузитьЗначения()));
	
	Отбор.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	
	СложныеОтборы = Новый Массив;
	Если Не омг_Филиалы.Количество() = 0 Тогда
		СложныеОтборы.Добавить("Филиал В (&Филиалы)");
	КонецЕсли;
	
	Отбор.Вставить("СложныеОтборы", СложныеОтборы);
	ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
		Новый Структура("Справочник, СписокВыбранных, Отбор", "Подразделения", СписокВыбранных, Отбор), Элементы.омг_Отделения,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	омг_Филиалы = ВыбранноеЗначение;
	
	ОбновитьСписокТекущихПациентовСтационара(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ОтделенияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	омг_Отделения = ВыбранноеЗначение;
	
	ОбновитьСписокТекущихПациентовСтационара(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыПриИзменении(Элемент)
	
	Если Не омг_Филиалы.Количество() = 0 Тогда
		омг_Отделения.Очистить();
	КонецЕсли;
	ОбновитьСписокТекущихПациентовСтационара(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура омг_ОтделенияПриИзменении(Элемент)

	ОбновитьСписокТекущихПациентовСтационара(Неопределено);

КонецПроцедуры

#КонецОбласти
